In [1]:
import numpy as np
import pandas as pd
import scipy.stats as stats

In [2]:
data=pd.read_csv("C:\Games\Bhag Milkha Bhag 2013 Hindi MC DVDScr Xvid AC3 IcTv\Desktop\CSV\BuyerRatio.csv")

In [3]:
data

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [4]:
data.corr()

       East  West  North  South
East    1.0   1.0    1.0    1.0
West    1.0   1.0    1.0    1.0
North   1.0   1.0    1.0    1.0
South   1.0   1.0    1.0    1.0

In [5]:
data.describe()

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [7]:
_,p_value=stats.f_oneway(data.iloc[:,1], data.iloc[:,2],data.iloc[:,3], data.iloc[:,4])

In [8]:
p_value

0.8204060154887464

In [9]:
if p_value<0.05:
    print("we are rejecting null hypothesis")
else:
    print("we are accepting null hypothesis")

we are accepting null hypothesis